{
  "platform": "pc", 
  "modPage": null, 
  "name": "CustomSabersLite", 
  "game_ver": [
    "1.40.3", 
    "1.40.4", 
    "1.40.5", 
    "1.40.6", 
    "1.40.7", 
    "1.40.8"
  ], 
  "desc_zh": null, 
  "extern_links": [], 
  "iscore": false, 
  "authors": [
    "qqrz997"
  ], 
  "desc_en": "### Notice\n\nSome sabers have shaders that are compiled for the old unity version used prior to Beat Saber 1.29.4, and may not render properly at all. However, a wide range of sabers are still completely functional and it is up to the saber creators to update the shaders they used if they are broken.\n\nTo read more about migrating sabers to the newer versions of Beat Saber, read [this wiki page](https://bsmg.wiki/models/shader-migration.html).\n\nYou can enable multi-pass rendering to make a majority of old models work again, with a small performance cost. If you haven't done this already, you can find it in-game by navigating to \n\n- Settings -> Mod Settings -> Asset Bundles, \n\nthen enabling the multi-pass toggle.\n\n# Custom Sabers Lite\n\nCustomSabersLite is a minimal-feature custom sabers mod, which aims to provide a user-friendly experience without overwhelming players with too many settings and menus; people who were used to the original CustomSabers may find this mod preferable over the alternatives. This mod allows you to load .saber files from [ModelSaber](https://modelsaber.com/Sabers/?pc) and .whacker files from [Qosmetics](https://bsmg.wiki/models/custom-sabers.html#quest-sabers) and replace the default sabers with them.\n\nCredit to the original [Custom Sabers](https://github.com/Kylemc1413/CustomSaberPlugin) mod and its contributors, which was the basis for this mod's creation.\n\nOlder versions of CustomSabersLite are not supported. If you find issues using an older version then I won't be able to help.\n\n## Adding Sabers and Changing Settings\n\nSettings are set in-game from the left panel in the Custom Sabers menu. This is accessed by clicking the `Custom Sabers` button on the left of the main menu.\n\nYou can find the custom sabers folder by pressing the \"open folder\" button inside the Custom Sabers menu, which will open the folder on your computer. Alternatively, you can navigate to your game's installation directory and, after launching the game once, you will find the `CustomSabers` folder there. Place `.saber` or `.whacker` files in this folder.\n\nYou can also adjust settings by clicking the Mods tab at the top of the gameplay settings menu to the left of the song list, then clicking the Custom Sabers tab.\n", 
  "editpath": "src/server/mod_db/pc/CustomSabersLite.json", 
  "name_zh": null
}