{
  "platform": "pc", 
  "modPage": null, 
  "name": "HitScoreVisualizer", 
  "game_ver": [
    "1.40.3", 
    "1.40.4", 
    "1.40.5", 
    "1.40.6", 
    "1.40.7", 
    "1.40.8"
  ], 
  "desc_zh": null, 
  "extern_links": [
    "https://github.com/qqrz997/HitScoreVisualizer"
  ], 
  "iscore": false, 
  "authors": [
    "qqrz997"
  ], 
  "desc_en": "# HitScoreVisualizer\n\nThis is a mod that will let you configure the score effects when notes are sliced.\n\n## Usage\n\nOn the first run, it will create a new folder in your Beat Saber installtion folder at `UserData\\HitScoreVisualizer` and a default config for those who didn't have one yet.\nIn this folder, you can drop all your HSV config files - they will have the `.json` file extension. It doesn't even matter if you create new folders in that folder, HSV will still be able to find them all.\n\nHaving dropped your config files in the folder doesn't mean you're ready to go yet as you still need to select it in-game. It's pretty straight-forward to do so, but follow the steps below if you really want to be sure.\n\n1) You'll need to start up Beat Saber, however, you don't have to restart it to add new configs\n2) Select HitScoreVisualizer in the mod list on the left side of the main menu\n3) Choose your desired config and press the \"select\" button\n\nAs you might have noticed, each config has a text below its name that describes it current state. You can find all the possible config states in the table below.\n\n| State (internal) | Text shown in-game                                 | Description                                                                                                                                      |\n|------------------|----------------------------------------------------|--------------------------------------------------------------------------------------------------------------------------------------------------|\n| Broken           | Invalid config. Not selectable...                  | Means that the file cannot be loaded, it's either not a valid HSV config file or not a config file at all.                                       |\n| Incompatible     | Config is too old. Targets version {Version}       | The config is too old and therefore can't be migrated to the newer format automagically.                                                         |\n| ValidationFailed | Validation failed, please check the file again.    | You made an error in the config itself, you can check the logs to see what might be wrong (will be logged as a warning).                         |\n| NeedsMigration   | Config made for HSV {Version}. Migration possible. | The config is valid, but still needs a migration to the newer format, this can be done automagically though.                                     |\n| Compatible       | OK - {Version}                                     | The config file is just fine, nothing special needs to happen. Shows the version for which it was originally made.                               |\n| NewerVersion     | Config is too new. Targets version {Version}       | The config file is made for a newer version of HSV and therefore won't be allowed to be loaded in as it's correct workings cannot be guaranteed. |\n\n### Config migration remark\n\nIf one of your configs needed migration upon selection. The old config will automagically be backed up to the folder `UserData\\HitScoreVisualizer\\Backups` (will be created if it doesn't exist) and the migrated config will be saved to the original file instead.\n\nHowever, all configs placed in that folder will **NOT** be loaded by HSV. This behavior is by-design and is intended as a safety measure, to prevent accidental migration issues with backups.\nIf you want revert to a backup, move one of the files back to the main folder (or another folder in the main folder if you're using a folder structure.)\n\n## Editing Configs\n\nWhen first running the game, it will create a default config which can be found at `UserData\\HitScoreVisualizer\\HitScoreVisualizerConfig-default.json`. Use that file as a starting point, in case you want to customize it. If you do start with this config, make sure to set `isDefaultConfig` to `false`.\n\nThe full rundown on the features of a HitScoreVisualizer config can be found in the main README on its [GitHub page](https://github.com/ErisApps/HitScoreVisualizer?tab=readme-ov-file#how-to-config-aka-config-explained).", 
  "editpath": "src/server/mod_db/pc/HitScoreVisualizer.json", 
  "name_zh": null, 
  "beatmods_id": 40
}